47 4949
102 24
115 10
39 33
107 26
52 42
120 27
99 21
44 29
112 22
57 39
104 17
49 37
117 16
96 38
109 18
33 50
122 30
101 5
114 7
59 45
93 43
106 32
51 46
119 23
98 19
43 47
111 12
56 41
35 49
103 15
48 40
116 11
95 34
40 36
9601 4
108 14
121 20
100 13
45 31
113 28
92 44
37 48
105 9
50 35
118 25
97 6
110 8
4 6 51
7 5 52
4 11 53
9 8 54
4 10 55
52 5 56
8 13 57
4 19 58
51 52 59
6 7 60
6 8 61
4 22 62
4 12 63
53 17 64
7 12 65
4 15 66
4 18 67
54 15 68
14 13 69
64 5 70
56 8 71
66 71 72
4 9 73
5 7 74
4 54 75
6 14 76
67 61 77
77 20 78
58 16 79
79 9 80
53 56 81
4 23 82
81 10 83
69 68 84
80 84 85
51 57 86
63 24 87
73 10 88
85 10 89
65 16 90
4 21 91
9 11 92
90 57 93
4 8 94
5 10 95
5 13 96
4 14 97
25 74 98
4 24 99
94 5 100
12 18 101
9 13 102
6 13 103
101 5 104
55 104 105
9 5 106
100 60 107
92 17 108
82 108 109
16 7 110
14 6 111
15 5 112
5 8 113
4 65 114
55 5 115
4 7 116
60 26 117
12 7 118
62 117 119
21 5 120
53 23 121
76 14 122
121 12 123
12 11 124
115 98 125
125 76 126
62 106 127
114 103 128
6 10 129
4 52 130
4 13 131
6 11 132
9 76 133
59 6 134
12 23 135
116 9 136
51 93 137
21 17 138
63 8 139
55 11 140
127 120 141
136 98 142
58 20 143
62 14 144
6 52 145
144 61 146
73 11 147
110 93 148
55 102 149
111 57 150
106 69 151
4 17 152
148 96 153
99 151 154
82 17 155
19 122 156
62 12 157
12 8 158
55 153 159
16 10 160
113 11 161
118 11 162
97 60 163
163 112 164
21 11 165
60 10 166
97 124 167
51 8 168
130 10 169
149 95 170
62 111 171
70 52 172
99 12 173
20 15 174
58 5 175
11 10 176
9 10 177
171 174 178
178 93 179
53 12 180
119 68 181
5 14 182
91 166 183
6 20 184
92 5 185
155 185 186
14 5 187
157 57 188
102 161 189
169 189 190
9 7 191
190 133 192
16 18 193
58 129 194
14 135 195
16 8 196
12 14 197
58 145 198
5 52 199
97 6 200
4 20 201
16 14 202
201 182 203
203 195 204
28 16 205
60 18 206
4 25 207
99 206 208
103 135 209
67 5 210
26 5 211
210 209 212
12 160 213
55 205 214
6 138 215
214 145 216
9 14 217
58 7 218
208 150 219
152 213 220
26 10 221
9 193 222
27 11 223
146 176 224
10 5 225
6 54 226
202 60 227
10 11 228
198 150 229
100 223 230
218 102 231
23 184 232
175 215 233
119 96 234
67 12 235
15 227 236
66 7 237
91 12 238
11 7 239
64 177 240
231 112 241
9 158 242
11 226 243
131 113 244
15 17 245
22 162 246
51 191 247
16 165 248
154 10 249
244 225 250
196 243 251
235 251 252
53 61 253
194 5 254
173 124 255
254 156 256
207 9 257
257 103 258
258 248 259
58 12 260
247 246 261
17 6 262
255 156 263
260 132 264
102 5 265
62 162 266
75 13 267
160 239 268
128 10 269
267 268 270
219 10 271
21 95 272
270 133 273
91 101 274
253 221 275
6 217 276
131 95 277
220 95 278
173 52 279
11 17 280
264 10 281
91 110 282
74 11 283
277 283 284
116 276 285
282 25 286
279 228 287
6 112 288
140 118 289
289 288 290
146 95 291
286 96 292
55 22 293
11 96 294
14 20 295
285 232 296
200 57 297
120 61 298
63 298 299
280 74 300
11 156 301
140 103 302
302 222 303
127 272 304
211 301 305
194 305 306
238 110 307
12 24 308
23 8 309
132 242 310
114 308 311
58 14 312
74 21 313
274 18 314
9 245 315
129 10 316
158 15 317
314 313 318
318 133 319
191 21 320
55 18 321
130 13 322
4 5 323
146 294 324
91 17 325
12 197 326
138 326 327
55 327 328
12 21 329
325 110 330
330 138 331
140 310 332
52 236 333
7 333 334
73 334 335
64 56 336
131 9 337
321 122 338
91 320 339
11 23 340
5 113 341
175 340 342
212 10 343
342 341 344
237 184 345
8 11 346
157 197 347
63 98 348
132 96 349
6 25 350
53 7 351
18 18 352
114 23 353
155 9 354
112 300 355
180 355 356
23 9 357
91 161 358
149 5 359
169 162 360
16 5 361
307 176 362
262 22 363
58 95 364
55 357 365
352 68 366
312 361 367
6 165 368
51 14 369
21 26 370
124 17 371
365 366 372
67 96 373
358 74 374
53 122 375
373 222 376
10 10 377
173 110 378
91 65 379
315 11 380
62 60 381
53 113 382
6 57 383
382 8 384
384 177 385
165 61 386
130 386 387
91 158 388
55 363 389
63 7 390
131 117 391
4 26 392
237 316 393
364 265 394
82 199 395
58 371 396
116 196 397
24 24 398
99 368 399
399 118 400
220 5 401
14 11 402
58 65 403
339 187 404
80 402 405
9 21 406
94 193 407
98 20 408
129 11 409
262 26 410
410 9 411
392 411 412
337 398 413
13 187 414
14 95 415
19 74 416
199 346 417
200 309 418
413 417 419
407 416 420
400 20 421
82 350 422
4 408 423
152 129 424
12 22 425
167 10 426
13 74 427
353 10 428
97 317 429
66 52 430
293 166 431
389 96 432
67 102 433
422 95 434
433 414 435
390 427 436
430 20 437
55 17 438
132 74 439
436 295 440
82 439 441
354 138 442
97 9 443
9 22 444
97 329 445
97 54 446
200 211 447
199 13 448
387 236 449
139 5 450
55 9 451
111 370 452
58 452 453
90 245 454
64 454 455
7 6 456
16 11 457
152 199 458
51 7 459
55 21 460
445 349 461
403 309 462
379 377 463
91 197 464
397 232 465
99 118 466
66 93 467
431 5 468
9 15 469
51 11 470
132 11 471
75 11 472
115 6 473
91 61 474
62 5 475
182 20 476
22 22 477
12 12 478
188 10 479
252 10 480
443 211 481
351 6 482
59 129 483
18 22 484
369 317 485
61 15 486
11 20 487
58 469 488
466 18 489
18 54 490
8 135 491
5 165 492
55 491 493
475 425 494
494 187 495
115 18 496
18 12 497
354 187 498
9 25 499
53 74 500
82 265 501
307 11 502
115 5 503
15 95 504
99 65 505
464 118 506
63 300 507
82 5 508
136 477 509
122 182 510
140 383 511
25 76 512
509 415 513
63 512 514
55 383 515
22 60 516
381 510 517
312 329 518
14 12 519
460 471 520
311 10 521
459 7 522
207 409 523
520 448 524
82 129 525
54 13 526
418 10 527
65 377 528
160 17 529
16 52 530
486 96 531
21 528 532
97 529 533
500 490 534
534 76 535
65 23 536
4 16 537
132 17 538
478 13 539
472 12 540
97 380 541
152 315 542
51 532 543
456 380 544
505 346 545
381 11 546
140 544 547
8 68 548
152 350 549
100 132 550
549 5 551
522 531 552
497 228 553
131 5 554
369 553 555
25 102 556
115 516 557
323 484 558
558 487 559
9 24 560
438 444 561
451 30 562
62 316 563
293 6 564
140 56 565
10 265 566
92 20 567
274 22 568
74 10 569
131 177 570
15 187 571
238 98 572
231 504 573
393 150 574
4 93 575
397 548 576
8 492 577
388 577 578
337 556 579
99 195 580
19 12 581
387 571 582
562 95 583
550 295 584
518 221 585
561 10 586
58 61 587
239 9 588
499 5 589
579 96 590
446 5 591
62 538 592
5 23 593
91 519 594
446 95 595
31 10 596
296 10 597
91 60 598
65 103 599
152 16 600
99 593 601
463 599 602
175 113 603
91 118 604
570 588 605
600 112 606
351 9 607
55 92 608
217 14 609
207 5 610
140 7 611
602 10 612
13 96 613
493 10 614
26 96 615
482 370 616
177 17 617
55 148 618
91 567 619
20 68 620
465 10 621
347 10 622
179 10 623
174 158 624
496 9 625
52 11 626
403 103 627
379 23 628
61 112 629
89 29 630
628 613 631
604 8 632
565 11 633
537 22 634
381 176 635
12 52 636
25 448 637
238 637 638
110 19 639
9 95 640
88 150 641
165 242 642
60 13 643
339 227 644
6 21 645
138 95 646
496 177 647
21 221 648
647 153 649
451 27 650
339 415 651
146 5 652
6 15 653
605 19 654
506 10 655
351 226 656
152 60 657
632 74 658
16 19 659
155 60 660
147 10 661
660 24 662
16 13 663
79 10 664
564 272 665
82 539 666
61 236 667
152 609 668
229 10 669
66 536 670
406 76 671
51 18 672
116 68 673
431 476 674
388 10 675
675 177 676
639 61 677
4 677 678
587 26 679
55 246 680
11 187 681
22 316 682
99 589 683
142 10 684
6 18 685
389 5 686
293 7 687
33 10 688
348 682 689
672 317 690
25 113 691
132 5 692
311 96 693
19 20 694
182 14 695
388 243 696
97 92 697
680 10 698
697 681 699
607 667 700
611 444 701
22 5 702
594 225 703
155 199 704
323 27 705
130 15 706
706 242 707
99 202 708
560 202 709
115 113 710
511 10 711
457 709 712
175 6 713
713 712 714
107 694 715
140 626 716
99 617 717
557 349 718
60 536 719
10 476 720
94 719 721
131 7 722
4 96 723
708 14 724
542 232 725
14 68 726
55 217 727
4 32 728
554 21 729
323 215 730
729 118 731
666 10 732
94 12 733
102 95 734
97 620 735
157 14 736
578 96 737
19 118 738
625 596 739
53 5 740
18 161 741
25 5 742
581 110 743
460 76 744
131 329 745
70 225 746
4 196 747
58 6 748
657 743 749
739 153 750
736 624 751
557 132 752
364 734 753
55 12 754
253 26 755
731 349 756
22 113 757
580 10 758
140 425 759
217 111 760
207 760 761
75 21 762
51 10 763
676 176 764
95 10 765
97 478 766
82 9 767
103 5 768
762 14 769
727 98 770
608 10 771
610 112 772
772 11 773
773 310 774
769 663 775
767 69 776
369 14 777
99 61 778
24 202 779
14 406 780
70 18 781
459 21 782
65 8 783
687 184 784
20 18 785
485 566 786
63 757 787
751 76 788
82 526 789
180 22 790
16 111 791
66 785 792
654 457 793
636 13 794
390 629 795
16 176 796
95 11 797
218 61 798
74 8 799
269 29 800
518 26 801
62 9 802
668 10 803
228 726 804
79 804 805
443 95 806
63 796 807
363 96 808
91 20 809
592 10 810
51 581 811
75 566 812
62 409 813
811 742 814
780 349 815
568 815 816
62 471 817
564 120 818
158 5 819
235 228 820
807 265 821
379 22 822
572 10 823
368 295 824
90 10 825
4 113 826
285 10 827
244 720 828
656 10 829
565 176 830
63 457 831
409 5 832
82 832 833
791 294 834
14 54 835
67 6 836
177 5 837
4 30 838
111 11 839
798 646 840
696 10 841
578 10 842
563 95 843
392 526 844
511 68 845
323 380 846
537 57 847
238 409 848
63 217 849
21 74 850
813 530 851
329 850 852
60 11 853
55 852 854
24 151 855
53 135 856
100 315 857
26 95 858
22 834 859
82 695 860
157 859 861
53 659 862
323 108 863
863 74 864
857 738 865
596 808 866
128 29 867
82 118 868
17 406 869
11 158 870
610 869 871
862 95 872
817 799 873
847 74 874
745 615 875
91 6 876
563 68 877
152 5 878
568 824 879
17 539 880
21 158 881
865 880 882
822 10 883
61 10 884
400 640 885
515 10 886
490 870 887
51 22 888
103 887 889
4 205 890
58 889 891
888 783 892
844 10 893
21 320 894
793 242 895
172 688 896
52 642 897
546 295 898
337 897 899
499 476 900
12 19 901
722 20 902
62 92 903
53 110 904
54 765 905
664 905 906
11 68 907
64 132 908
775 95 909
94 124 910
748 69 911
5 22 912
716 138 913
508 11 914
463 96 915
101 901 916
12 10 917
457 916 918
17 526 919
51 918 920
175 919 921
130 236 922
14 61 923
425 10 924
482 648 925
16 294 926
115 691 927
587 221 928
215 68 929
138 96 930
146 11 931
871 415 932
486 187 933
139 295 934
113 10 935
66 12 936
766 221 937
560 406 938
26 113 939
63 69 940
62 65 941
235 794 942
653 158 943
12 624 944
144 944 945
67 226 946
83 29 947
21 96 948
438 209 949
535 10 950
169 22 951
740 929 952
256 855 953
472 74 954
67 768 955
761 10 956
723 112 957
899 10 958
99 645 959
187 60 960
21 456 961
951 492 962
654 926 963
962 900 964
18 10 965
505 18 966
57 10 967
55 196 968
97 5 969
22 923 970
200 858 971
752 95 972
744 95 973
744 5 974
12 615 975
155 5 976
54 10 977
379 975 978
554 912 979
608 16 980
171 120 981
228 7 982
52 8 983
894 187 984
716 646 985
66 65 986
99 519 987
393 20 988
91 5 989
4 29 990
7 76 991
759 22 992
740 223 993
171 620 994
993 530 995
207 60 996
701 95 997
6 120 998
175 132 999
14 9 1000
503 965 1001
321 853 1002
618 68 1003
12 225 1004
124 10 1005
159 96 1006
152 76 1007
1007 24 1008
358 991 1009
24 11 1010
506 779 1011
9 370 1012
91 960 1013
789 68 1014
116 61 1015
97 12 1016
61 11 1017
920 217 1018
293 884 1019
1018 95 1020
52 685 1021
664 20 1022
154 29 1023
8 10 1024
15 7 1025
26 68 1026
5 11 1027
970 95 1028
959 217 1029
954 225 1030
705 313 1031
670 68 1032
114 648 1033
165 530 1034
1031 837 1035
982 248 1036
388 1036 1037
607 933 1038
91 7 1039
92 640 1040
196 11 1041
131 12 1042
1037 242 1043
388 74 1044
11 61 1045
868 221 1046
778 866 1047
14 96 1048
752 476 1049
51 566 1050
51 497 1051
388 21 1052
87 24 1053
55 20 1054
1051 1041 1055
20 10 1056
1046 17 1057
68 10 1058
160 11 1059
833 150 1060
802 74 1061
580 74 1062
351 16 1063
5 239 1064
58 187 1065
1000 211 1066
980 349 1067
66 643 1068
91 456 1069
941 10 1070
809 61 1071
792 8 1072
201 643 1073
1072 129 1074
625 31 1075
1074 222 1076
122 20 1077
67 117 1078
1070 702 1079
54 5 1080
653 8 1081
67 1081 1082
206 645 1083
446 96 1084
53 1083 1085
9 213 1086
1079 825 1087
500 18 1088
1075 984 1089
352 1064 1090
116 6 1091
124 11 1092
205 444 1093
16 15 1094
218 380 1095
314 196 1096
97 184 1097
139 95 1098
516 11 1099
1088 133 1100
580 68 1101
19 52 1102
60 983 1103
135 8 1104
568 187 1105
66 539 1106
118 18 1107
51 1099 1108
115 11 1109
1082 938 1110
323 129 1111
1110 161 1112
293 1005 1113
464 12 1114
826 21 1115
10 176 1116
438 636 1117
248 530 1118
323 18 1119
398 406 1120
155 132 1121
611 1118 1122
626 5 1123
1054 1090 1124
1052 1123 1125
1029 1040 1126
1030 642 1127
922 295 1128
175 14 1129
121 177 1130
161 20 1131
12 102 1132
144 1131 1133
279 1116 1134
1111 5 1135
293 54 1136
323 1093 1137
1136 414 1138
802 1034 1139
1025 349 1140
5 1140 1141
232 10 1142
472 1141 1143
357 930 1144
881 101 1145
515 1144 1146
323 1145 1147
66 692 1148
22 569 1149
560 9 1150
226 228 1151
15 1151 1152
158 95 1153
51 1152 1154
97 135 1155
98 11 1156
207 122 1157
482 1120 1158
1157 5 1159
10 96 1160
22 74 1161
657 738 1162
728 196 1163
594 720 1164
445 692 1165
687 68 1166
62 444 1167
371 68 1168
94 1168 1169
323 223 1170
1115 519 1171
1108 741 1172
323 57 1173
64 1012 1174
247 961 1175
856 74 1176
836 211 1177
5 825 1178
605 165 1179
14 380 1180
352 96 1181
106 346 1182
16 280 1183
216 29 1184
55 103 1185
407 1178 1186
1147 406 1187
98 10 1188
30 1132 1189
1045 221 1190
702 1189 1191
290 1190 1192
482 1191 1193
1015 138 1194
22 96 1195
99 111 1196
94 797 1197
74 20 1198
191 13 1199
55 110 1200
103 7 1201
19 65 1202
890 1201 1203
1202 939 1204
747 1204 1205
1185 414 1206
4 1156 1207
992 68 1208
171 977 1209
696 569 1210
415 10 1211
116 102 1212
70 20 1213
1199 688 1214
58 1214 1215
705 22 1216
723 1150 1217
1119 19 1218
64 1004 1219
838 819 1220
116 629 1221
6 504 1222
477 96 1223
362 29 1224
58 96 1225
554 22 1226
1096 567 1227
1057 924 1228
976 132 1229
949 10 1230
55 659 1231
562 5 1232
15 96 1233
438 162 1234
99 56 1235
91 1092 1236
1068 935 1237
247 1028 1238
989 217 1239
986 309 1240
876 484 1241
670 10 1242
1241 160 1243
422 5 1244
323 20 1245
63 309 1246
276 68 1247
55 1247 1248
72 29 1249
53 54 1250
1218 456 1251
1097 569 1252
998 779 1253
475 1253 1254
839 5 1255
820 295 1256
92 242 1257
1250 20 1258
13 12 1259
1226 280 1260
1259 118 1261
831 1261 1262
1217 272 1263
1170 5 1264
150 10 1265
835 5 1266
132 95 1267
775 68 1268
701 96 1269
641 10 1270
293 17 1271
1260 10 1272
12 1255 1273
1196 176 1274
277 1273 1275
1171 1160 1276
19 19 1277
1124 671 1278
54 26 1279
140 819 1280
52 13 1281
160 487 1282
418 29 1283
131 191 1284
685 5 1285
1271 74 1286
205 5 1287
1286 671 1288
1236 1222 1289
1137 1195 1290
115 1161 1291
592 1142 1292
904 24 1293
293 492 1294
152 383 1295
351 276 1296
162 17 1297
116 103 1298
193 8 1299
131 1282 1300
1299 60 1301
464 1301 1302
194 54 1303
1063 648 1304
11 5 1305
936 69 1306
568 917 1307
1306 113 1308
881 457 1309
238 1309 1310
25 68 1311
245 11 1312
369 10 1313
1313 12 1314
216 10 1315
131 104 1316
122 10 1317
63 19 1318
94 1297 1319
19 187 1320
6 26 1321
838 1153 1322
1114 110 1323
538 74 1324
371 74 1325
168 1325 1326
53 6 1327
259 10 1328
136 225 1329
53 20 1330
22 187 1331
1284 11 1332
1216 61 1333
1173 1211 1334
1333 225 1335
754 1183 1336
1159 20 1337
1065 215 1338
723 504 1339
1338 569 1340
388 691 1341
522 629 1342
574 29 1343
451 15 1344
91 409 1345
177 242 1346
134 29 1347
1344 1024 1348
1330 22 1349
116 1324 1350
1349 95 1351
469 8 1352
136 1312 1353
1239 68 1354
766 26 1355
482 1188 1356
1167 95 1357
1091 484 1358
54 96 1359
958 29 1360
171 948 1361
403 939 1362
835 96 1363
464 794 1364
722 499 1365
707 10 1366
165 589 1367
459 11 1368
62 456 1369
323 408 1370
51 309 1371
175 195 1372
171 11 1373
79 11 1374
55 74 1375
1369 191 1376
1356 95 1377
1376 106 1378
1298 133 1379
570 11 1380
116 1094 1381
140 1021 1382
1016 924 1383
689 95 1384
664 17 1385
463 95 1386
295 12 1387
99 1387 1388
55 26 1389
51 13 1390
9 187 1391
157 10 1392
1365 68 1393
1392 1257 1394
297 10 1395
235 16 1396
1200 24 1397
1069 1181 1398
1175 1010 1399
996 106 1400
943 76 1401
21 21 1402
747 9 1403
695 444 1404
4 1404 1405
297 29 1406
274 19 1407
62 226 1408
1396 967 1409
1373 24 1410
542 31 1411
1410 1107 1412
1342 741 1413
1235 232 1414
1130 487 1415
19 1103 1416
996 1086 1417
16 57 1418
903 930 1419
7 837 1420
67 765 1421
728 166 1422
511 643 1423
22 538 1424
526 7 1425
255 1424 1426
460 113 1427
389 95 1428
351 368 1429
367 29 1430
266 10 1431
186 29 1432
55 185 1433
85 29 1434
62 76 1435
29 10 1436
12 187 1437
1403 1287 1438
1400 487 1439
16 22 1440
1381 1233 1441
499 1346 1442
1307 96 1443
13 1442 1444
1294 645 1445
1231 1444 1446
1445 227 1447
1277 158 1448
136 1448 1449
1163 642 1450
1105 27 1451
65 22 1452
836 32 1453
835 427 1454
809 1454 1455
323 691 1456
575 96 1457
472 569 1458
507 10 1459
350 96 1460
286 68 1461
140 184 1462
142 29 1463
53 124 1464
103 95 1465
1446 10 1466
277 1352 1467
1341 1182 1468
1291 349 1469
848 1266 1470
745 26 1471
1207 671 1472
29 1066 1473
728 1059 1474
591 1473 1475
91 1021 1476
987 132 1477
976 182 1478
946 295 1479
873 10 1480
23 797 1481
619 29 1482
446 615 1483
91 14 1484
463 68 1485
235 377 1486
269 265 1487
210 11 1488
4 193 1489
63 129 1490
1489 1102 1491
217 20 1492
1491 14 1493
1453 797 1494
1493 111 1495
1494 406 1496
990 1416 1497
1407 1359 1498
15 68 1499
443 1311 1500
1245 5 1501
1225 10 1502
876 1223 1503
903 138 1504
860 31 1505
226 10 1506
447 29 1507
183 29 1508
113 15 1509
438 1465 1510
1425 671 1511
14 1511 1512
1408 11 1513
809 1512 1514
63 1402 1515
132 138 1516
1368 938 1517
1212 504 1518
1517 133 1519
131 1104 1520
1102 409 1521
51 1521 1522
990 10 1523
953 10 1524
1523 497 1525
171 20 1526
1525 371 1527
99 839 1528
351 768 1529
748 370 1530
252 702 1531
57 68 1532
53 639 1533
554 556 1534
469 530 1535
515 20 1536
99 1535 1537
430 132 1538
53 380 1539
116 226 1540
16 138 1541
130 24 1542
1490 177 1543
1421 20 1544
12 457 1545
140 5 1546
1358 10 1547
110 1331 1548
1251 948 1549
62 1548 1550
7 177 1551
961 1149 1552
969 1010 1553
904 548 1554
636 228 1555
618 10 1556
110 617 1557
578 68 1558
484 187 1559
114 370 1560
25 265 1561
224 29 1562
167 29 1563
114 14 1564
350 182 1565
451 1559 1566
1056 1552 1567
1533 102 1568
1389 1567 1569
1515 1440 1570
1464 76 1571
1458 1149 1572
1411 1420 1573
6 22 1574
177 11 1575
1327 211 1576
1318 32 1577
55 1285 1578
1577 492 1579
51 5 1580
1246 10 1581
94 1080 1582
171 54 1583
97 16 1584
473 29 1585
160 5 1586
201 215 1587
82 184 1588
1584 27 1589
1580 65 1590
1589 110 1591
987 1557 1592
67 1541 1593
1380 54 1594
1594 1367 1595
131 135 1596
346 1104 1597
1596 1597 1598
58 1103 1599
1078 96 1600
406 1077 1601
1042 30 1602
6 191 1603
416 1017 1604
755 74 1605
16 1604 1606
705 1606 1607
557 692 1608
387 15 1609
321 12 1610
168 20 1611
73 120 1612
1610 371 1613
6 24 1614
1572 96 1615
99 74 1616
24 1555 1617
1616 1551 1618
1540 1617 1619
1534 96 1620
1264 1532 1621
563 1509 1622
22 1460 1623
1456 295 1624
747 1623 1625
1427 1198 1626
1388 98 1627
1375 640 1628
1105 1305 1629
99 1180 1630
1129 176 1631
7 1094 1632
1063 370 1633
604 1632 1634
992 96 1635
293 61 1636
793 5 1637
759 10 1638
609 96 1639
99 1639 1640
63 477 1641
473 23 1642
237 383 1643
31 232 1644
140 20 1645
1622 74 1646
351 1565 1647
129 17 1648
1319 1481 1649
155 1437 1650
920 1391 1651
1385 95 1652
18 217 1653
25 9 1654
1653 60 1655
451 1655 1656
1078 10 1657
1039 177 1658
1027 406 1659
1658 10 1660
280 1659 1661
67 60 1662
95 1661 1663
676 907 1664
878 27 1665
878 853 1666
839 74 1667
1667 76 1668
9 1668 1669
774 10 1670
725 10 1671
216 13 1672
54 176 1673
100 23 1674
82 7 1675
53 52 1676
1641 917 1677
1602 935 1678
1677 185 1679
337 1561 1680
109 1545 1681
1405 11 1682
1397 998 1683
1682 671 1684
826 894 1685
1212 112 1686
1203 933 1687
64 1058 1688
13 20 1689
1006 96 1690
155 1004 1691
182 742 1692
594 663 1693
121 1692 1694
187 642 1695
471 406 1696
1696 96 1697
97 1697 1698
388 98 1699
62 6 1700
179 29 1701
53 102 1702
140 60 1703
220 68 1704
5 301 1705
459 138 1706
221 1705 1707
530 13 1708
748 1707 1709
1647 68 1710
1645 415 1711
1590 1028 1712
1587 176 1713
60 20 1714
12 16 1715
1488 122 1716
1484 1059 1717
1716 406 1718
1462 96 1719
1426 10 1720
1390 32 1721
876 1320 1722
6 221 1723
1296 10 1724
676 11 1725
1264 967 1726
1176 68 1727
1122 29 1728
101 19 1729
1039 16 1730
1016 425 1731
989 741 1732
789 10 1733
438 768 1734
754 217 1735
727 408 1736
5 691 1737
496 406 1738
489 10 1739
287 29 1740
171 272 1741
252 213 1742
173 251 1743
70 191 1744
190 10 1745
173 69 1746
152 124 1747
100 98 1748
72 150 1749
1738 320 1750
1721 645 1751
1675 1279 1752
1751 161 1753
202 11 1754
1634 349 1755
1207 1601 1756
1579 10 1757
31 15 1758
5 18 1759
1436 104 1760
1371 68 1761
112 1281 1762
914 1265 1763
653 1762 1764
1193 76 1765
140 1764 1766
55 14 1767
1163 571 1768
745 1026 1769
987 118 1770
169 907 1771
757 10 1772
260 643 1773
586 29 1774
438 7 1775
25 95 1776
338 74 1777
63 165 1778
62 161 1779
266 1760 1780
100 11 1781
24 176 1782
1781 1066 1783
1175 1782 1784
702 57 1785
1114 1708 1786
1693 10 1787
123 1644 1788
1642 1317 1789
1592 68 1790
66 1574 1791
1564 726 1792
73 18 1793
1531 1321 1794
1477 68 1795
1452 671 1796
53 1796 1797
1371 1058 1798
1246 68 1799
10 17 1800
1042 659 1801
218 1012 1802
1801 187 1803
323 967 1804
836 858 1805
10 808 1806
798 138 1807
207 645 1808
632 569 1809
116 531 1810
286 5 1811
237 103 1812
235 52 1813
36 35 1814
1808 1017 1815
778 1806 1816
238 196 1817
1775 659 1818
1817 239 1819
1818 10 1820
1819 20 1821
1772 242 1822
160 1822 1823
74 52 1824
55 1823 1825
546 1824 1826
747 1737 1827
1717 569 1828
1685 1048 1829
1203 1669 1830
1666 866 1831
82 76 1832
1546 182 1833
62 113 1834
1345 68 1835
1323 779 1836
62 1279 1837
822 1265 1838
968 1180 1839
1129 317 1840
1109 11 1841
293 5 1842
1841 1048 1843
1068 113 1844
1057 425 1845
106 8 1846
826 984 1847
936 95 1848
913 68 1849
817 68 1850
701 10 1851
701 5 1852
685 383 1853
337 1853 1854
30 653 1855
583 29 1856
579 10 1857
500 456 1858
109 448 1859
438 96 1860
430 23 1861
237 102 1862
97 106 1863
469 1855 1864
1778 943 1865
838 1864 1866
1773 68 1867
1706 185 1868
4 1663 1869
1654 783 1870
1870 741 1871
826 1871 1872
175 57 1873
1636 548 1874
31 1603 1875
1591 20 1876
787 1875 1877
9 96 1878
1570 640 1879
1516 68 1880
74 1499 1881
1495 10 1882
1065 1321 1883
445 1267 1884
1159 1056 1885
140 1153 1886
1129 14 1887
560 1107 1888
337 6 1889
1053 9 1890
1889 497 1891
995 10 1892
1891 57 1893
31 21 1894
969 177 1895
935 589 1896
1895 530 1897
839 900 1898
871 187 1899
130 1898 1900
705 824 1901
659 780 1902
728 12 1903
62 1902 1904
606 29 1905
9 30 1906
482 272 1907
477 5 1908
477 68 1909
369 11 1910
115 349 1911
205 217 1912
152 197 1913
91 104 1914
62 74 1915
61 1912 1916
347 29 1917
351 1916 1918
1906 96 1919
67 1881 1920
55 54 1921
1846 120 1922
1921 120 1923
1812 1182 1924
986 1776 1925
1767 425 1926
12 13 1927
1665 943 1928
1091 1927 1929
868 26 1930
1522 295 1931
337 1401 1932
66 1285 1933
446 26 1934
4 182 1935
1183 96 1936
235 1936 1937
1155 29 1938
1069 648 1939
904 1024 1940
856 1024 1941
1008 31 1942
12 69 1943
947 158 1944
903 646 1945
856 643 1946
783 15 1947
140 1947 1948
62 7 1949
761 112 1950
748 202 1951
438 695 1952
116 692 1953
99 685 1954
140 609 1955
572 68 1956
467 10 1957
397 10 1958
393 95 1959
228 383 1960
11 380 1961
370 96 1962
247 1961 1963
369 187 1964
342 5 1965
99 60 1966
15 93 1967
119 10 1968
116 17 1969
64 61 1970
79 13 1971
1965 341 1972
1643 1960 1973
106 11 1974
51 1908 1975
890 1974 1976
472 1896 1977
1890 120 1978
438 54 1979
177 176 1980
1785 161 1981
5 1981 1982
1758 71 1983
267 1982 1984
67 1754 1985
62 132 1986
97 61 1987
157 1673 1988
969 1614 1989
1609 415 1990
337 943 1991
1542 54 1992
1991 1077 1993
260 1418 1994
1405 225 1995
1251 120 1996
1092 101 1997
58 1997 1998
1045 120 1999
570 1999 2000
1042 95 2001
66 1027 2002
986 742 2003
207 884 2004
868 8 2005
76 10 2006
23 837 2007
131 685 2008
670 280 2009
594 98 2010
560 11 2011
11 12 2012
237 526 2013
484 102 2014
443 2014 2015
422 20 2016
5 409 2017
175 402 2018
373 9 2019
323 60 2020
282 295 2021
2020 280 2022
280 68 2023
241 29 2024
182 11 2025
175 21 2026
15 61 2027
4 33 2028
57 7 2029
177 68 2030
105 2023 2031
2019 61 2032
367 1983 2033
1979 68 2034
1969 1729 2035
113 120 2036
1700 1962 2037
617 96 2038
74 68 2039
72 68 2040
101 95 2041
1910 92 2042
1868 1034 2043
2042 663 2044
2044 5 2045
1834 977 2046
1832 26 2047
2046 791 2048
1746 10 2049
7 20 2050
1730 21 2051
187 57 2052
1699 1499 2053
17 5 2054
1676 377 2055
2054 103 2056
58 124 2057
11 74 2058
2057 681 2059
722 1506 2060
1505 13 2061
132 68 2062
1388 1188 2063
1382 1363 2064
831 1363 2065
855 10 2066
64 54 2067
161 10 2068
379 1223 2069
1203 667 2070
878 1181 2071
1137 741 2072
1030 165 2073
1029 567 2074
766 1026 2075
111 948 2076
903 10 2077
892 29 2078
351 884 2079
878 380 2080
856 569 2081
54 11 2082
829 29 2083
25 182 2084
722 589 2085
673 10 2086
611 629 2087
204 617 2088
466 615 2089
82 609 2090
95 588 2091
168 571 2092
96 2091 2093
506 38 2094
62 2093 2095
2094 10 2096
15 12 2097
465 29 2098
462 29 2099
458 29 2100
453 29 2101
437 29 2102
360 10 2103
335 295 2104
67 316 2105
51 232 2106
208 10 2107
51 205 2108
9 112 2109
55 111 2110
66 111 2111
60 22 2112
2111 377 2113
438 2112 2114
23 17 2115
598 2097 2116
2084 425 2117
954 2076 2118
2035 160 2119
2027 1919 2120
118 2120 2121
2010 187 2122
1505 2121 2123
2122 1614 2124
13 68 2125
8 765 2126
2002 907 2127
1992 1198 2128
1975 60 2129
263 1967 2130
1954 1492 2131
118 10 2132
1942 1943 2133
74 133 2134
1858 272 2135
9 52 2136
1842 96 2137
1793 653 2138
1752 415 2139
140 226 2140
1531 1723 2141
1715 245 2142
60 68 2143
464 1695 2144
114 2143 2145
1542 1695 2146
1039 1648 2147
856 8 2148
904 8 2149
4 1586 2150
914 150 2151
1467 96 2152
1436 153 2153
803 2153 2154
1435 5 2155
1323 10 2156
980 1267 2157
482 98 2158
1231 232 2159
2158 225 2160
55 1180 2161
1167 68 2162
1130 907 2163
1069 370 2164
131 1059 2165
1013 68 2166
13 113 2167
608 907 2168
882 10 2169
752 68 2170
147 688 2171
487 643 2172
13 617 2173
307 2172 2174
322 2173 2175
52 538 2176
509 187 2177
82 2176 2178
503 23 2179
502 29 2180
486 95 2181
73 484 2182
66 90 2183
459 102 2184
2183 22 2185
456 18 2186
4 454 2187
64 213 2188
140 191 2189
187 61 2190
160 96 2191
130 22 2192
383 10 2193
244 10 2194
936 68 2195
2140 96 2196
132 2132 2197
554 2117 2198
1294 2197 2199
2105 95 2200
2095 61 2201
22 17 2202
2047 232 2203
478 2029 2204
2026 6 2205
293 2204 2206
2205 1586 2207
1319 2017 2208
6 1320 2209
1987 5 2210
520 74 2211
1951 26 2212
10 21 2213
6 30 2214
1913 102 2215
1894 197 2216
2215 184 2217
76 18 2218
228 1759 2219
1750 187 2220
1054 2219 2221
1699 112 2222
466 26 2223
1662 19 2224
23 1648 2225
2224 1048 2226
55 2225 2227
67 1575 2228
266 29 2229
140 1506 2230
145 13 2231
131 1452 2232
1435 18 2233
1427 5 2234
196 642 2235
1239 1058 2236
592 232 2237
1096 406 2238
21 1086 2239
74 6 2240
564 2239 2241
1065 57 2242
1052 161 2243
799 1027 2244
2243 7 2245
413 2244 2246
868 1026 2247
969 103 2248
890 853 2249
54 95 2250
793 95 2251
5 112 2252
360 688 2253
231 2252 2254
60 7 2255
51 663 2256
67 663 2257
140 636 2258
626 487 2259
62 2259 2260
162 10 2261
580 569 2262
55 2261 2263
517 96 2264
79 484 2265
118 427 2266
235 427 2267
82 6 2268
130 21 2269
2268 92 2270
62 371 2271
358 52 2272
293 117 2273
286 95 2274
278 29 2275
207 106 2276
200 102 2277
2276 23 2278
189 133 2279
180 110 2280
158 20 2281
73 6 2282
20 21 2283
135 14 2284
2283 1729 2285
58 2284 2286
819 2285 2287
161 96 2288
152 2287 2289
2271 197 2290
2270 68 2291
2290 95 2292
406 227 2293
2267 8 2294
2242 96 2295
2240 69 2296
1119 2296 2297
91 2218 2298
2216 794 2299
1476 2299 2300
2188 2193 2301
82 122 2302
55 262 2303
2178 96 2304
2161 295 2305
2138 1198 2306
2129 61 2307
523 2126 2308
2307 120 2309
175 2109 2310
2108 6 2311
152 102 2312
228 310 2313
2051 1888 2314
296 2313 2315
1730 2030 2316
132 2007 2317
1986 646 2318
23 2317 2319
136 18 2320
64 2319 2321
325 61 2322
140 16 2323
19 202 2324
200 1909 2325
2324 213 2326
100 2326 2327
66 16 2328
16 76 2329
20 228 2330
1800 1080 2331
2330 76 2332
968 2331 2333
1039 2332 2334
1779 1401 2335
1779 943 2336
201 1715 2337
1702 20 2338
1702 1492 2339
168 15 2340
103 1689 2341
1665 1401 2342
62 2341 2343
1591 9 2344
8 96 2345
2344 1017 2346
64 68 2347
62 1460 2348
283 1391 2349
1380 9 2350
2350 1367 2351
152 1317 2352
67 1317 2353
1307 1257 2354
57 1281 2355
653 1233 2356
600 2355 2357
728 2356 2358
1172 10 2359
60 1080 2360
1017 799 2361
97 2361 2362
999 68 2363
970 5 2364
969 350 2365
960 138 2366
2366 569 2367
58 2367 2368
12 26 2369
801 29 2370
403 2369 2371
728 768 2372
18 768 2373
767 17 2374
31 2373 2375
747 516 2376
77 2375 2377
2376 510 2378
728 60 2379
695 185 2380
132 2380 2381
11 667 2382
55 2381 2383
130 2382 2384
9 27 2385
572 288 2386
67 2385 2387
257 556 2388
532 68 2389
14 478 2390
475 11 2391
64 7 2392
438 5 2393
406 221 2394
228 406 2395
171 2395 2396
393 29 2397
388 24 2398
18 329 2399
296 29 2400
193 2399 2401
249 29 2402
152 2401 2403
17 213 2404
207 12 2405
145 2404 2406
2405 74 2407
82 2406 2408
204 29 2409
66 202 2410
196 95 2411
131 2411 2412
8 182 2413
178 12 2414
66 161 2415
160 10 2416
157 8 2417
58 122 2418
72 19 2419
66 56 2420
62 20 2421
4 37 2422
2421 2186 2423
351 2416 2424
2423 102 2425
2414 1418 2426
2425 76 2427
2322 2413 2428
131 182 2429
169 102 2430
2429 406 2431
218 383 2432
2431 692 2433
34 2389 2434
2387 96 2435
1660 2434 2436
2328 1056 2437
2323 398 2438
2303 19 2439
2438 96 2440
2439 694 2441
685 2288 2442
2280 1980 2443
2273 726 2444
2269 52 2445
570 2266 2446
2445 310 2447
2257 1689 2448
2255 531 2449
31 2449 2450
55 16 2451
584 2450 2452
2248 68 2453
2245 349 2454
18 5 2455
2227 95 2456
2223 20 2457
2206 2011 2458
2198 96 2459
191 10 2460
2189 7 2461
262 2460 2462
2461 68 2463
91 2462 2464
12 15 2465
2179 122 2466
31 23 2467
1971 2125 2468
1501 2467 2469
90 13 2470
2110 1909 2471
325 5 2472
770 31 2473
2472 370 2474
247 2066 2475
2061 177 2476
124 2050 2477
131 2041 2478
959 2477 2479
132 10 2480
54 2038 2481
51 21 2482
55 6 2483
1994 1714 2484
1985 9 2485
27 177 2486
1964 1056 2487
51 2486 2488
1964 20 2489
1946 10 2490
1935 225 2491
1926 95 2492
1926 5 2493
1341 1922 2494
1915 24 2495
8 6 2496
2495 492 2497
1903 977 2498
98 112 2499
23 14 2500
337 2499 2501
63 2500 2502
10 153 2503
52 377 2504
1750 227 2505
51 1663 2506
1660 532 2507
13 5 2508
1539 295 2509
62 1516 2510
155 12 2511
457 5 2512
1429 10 2513
1394 10 2514
1389 20 2515
81 1363 2516
1331 1305 2517
101 2517 2518
1293 29 2519
762 2518 2520
1291 1267 2521
110 1281 2522
143 1265 2523
312 2522 2524
1245 95 2525
1245 124 2526
1235 1142 2527
1171 225 2528
1130 294 2529
1095 295 2530
25 1086 2531
1085 10 2532
99 1080 2533
31 1066 2534
1043 29 2535
1025 184 2536
66 60 2537
114 1005 2538
388 228 2539
982 444 2540
2539 92 2541
247 2540 2542
130 929 2543
19 926 2544
140 912 2545
588 2544 2546
890 185 2547
82 797 2548
116 796 2549
782 10 2550
19 457 2551
749 29 2552
607 2551 2553
747 21 2554
721 29 2555
696 68 2556
293 695 2557
119 688 2558
140 663 2559
650 31 2560
152 643 2561
152 6 2562
66 519 2563
515 19 2564
489 96 2565
489 68 2566
74 486 2567
467 29 2568
101 2567 2569
466 221 2570
260 2569 2571
446 221 2572
140 444 2573
443 96 2574
438 122 2575
99 409 2576
2575 135 2577
382 10 2578
339 193 2579
322 29 2580
293 118 2581
284 96 2582
2581 103 2583
233 95 2584
16 213 2585
207 113 2586
202 95 2587
200 120 2588
193 22 2589
79 187 2590
157 118 2591
152 103 2592
103 20 2593
80 69 2594
33 11 2595
76 11 2596
115 129 2597
1609 2587 2598
2597 265 2599
217 96 2600
2579 24 2601
2573 95 2602
2601 417 2603
91 457 2604
2603 133 2605
581 457 2606
2560 1266 2607
6 2606 2608
10 68 2609
575 2608 2610
594 2609 2611
2476 2546 2612
2541 2512 2613
2473 2536 2614
1279 726 2615
11 54 2616
121 2615 2617
76 5 2618
2483 477 2619
2213 2618 2620
2619 17 2621
634 2620 2622
2621 2136 2623
99 2481 2624
115 2480 2625
2469 1880 2626
12 110 2627
8 2442 2628
2430 2036 2629
390 2628 2630
23 118 2631
131 124 2632
163 15 2633
2409 21 2634
2633 74 2635
2634 2190 2636
2408 95 2637
350 217 2638
2393 1027 2639
2638 242 2640
62 2640 2641
2391 2006 2642
685 2360 2643
2357 10 2644
96 10 2645
146 2345 2646
1903 54 2647
140 2281 2648
53 118 2649
322 2279 2650
2265 20 2651
52 20 2652
610 54 2653
2249 74 2654
2238 310 2655
7 1673 2656
2214 68 2657
2182 2656 2658
672 2657 2659
747 2191 2660
14 14 2661
64 2142 2662
1368 2134 2663
75 24 2664
157 2082 2665
10 29 2666
53 2068 2667
731 2062 2668
348 2056 2669
2052 74 2670
55 2670 2671
2048 10 2672
383 2039 2673
143 150 2674
2008 10 2675
14 16 2676
1994 1211 2677
1985 1669 2678
1894 1880 2679
1501 2679 2680
1570 1878 2681
1352 96 2682
22 102 2683
350 20 2684
1091 2683 2685
475 1723 2686
30 6 2687
1662 15 2688
1587 11 2689
1586 741 2690
672 2690 2691
55 1574 2692
1097 1545 2693
1526 569 2694
1488 76 2695
1464 1077 2696
280 5 2697
1458 1161 2698
152 1437 2699
2698 225 2700
1408 294 2701
51 1402 2702
1385 20 2703
91 52 2704
31 1363 2705
1355 29 2706
81 2705 2707
19 13 2708
917 96 2709
475 1321 2710
1216 2709 2711
1318 1000 2712
2712 1287 2713
1277 415 2714
1263 29 2715
136 1181 2716
1139 10 2717
94 95 2718
228 1107 2719
2718 294 2720
515 2719 2721
1097 74 2722
19 1066 2723
91 1040 2724
508 2723 2725
1013 295 2726
990 6 2727
983 5 2728
175 967 2729
959 96 2730
917 95 2731
97 866 2732
568 368 2733
18 8 2734
369 819 2735
4 797 2736
609 10 2737
51 783 2738
67 2737 2739
766 10 2740
766 615 2741
745 221 2742
17 96 2743
739 148 2744
736 14 2745
708 295 2746
175 685 2747
656 29 2748
116 653 2749
581 643 2750
630 6 2751
604 98 2752
8 593 2753
132 589 2754
369 589 2755
575 10 2756
247 566 2757
297 566 2758
563 96 2759
438 9 2760
554 370 2761
6 9 2762
522 184 2763
501 29 2764
200 484 2765
483 29 2766
434 29 2767
423 29 2768
323 409 2769
58 383 2770
368 74 2771
348 122 2772
307 225 2773
160 95 2774
273 6 2775
252 29 2776
58 195 2777
152 20 2778
149 96 2779
114 11 2780
114 101 2781
108 96 2782
62 2782 2783
58 92 2784
84 10 2785
58 74 2786
4 27 2787
2786 280 2788
2778 19 2789
274 68 2790
2789 7 2791
2762 1281 2792
2791 102 2793
31 2753 2794
15 6 2795
2432 2794 2796
369 2795 2797
682 96 2798
75 855 2799
101 2798 2800
64 2731 2801
1115 2800 2802
438 12 2803
475 2714 2804
2702 101 2805
58 60 2806
2692 120 2807
171 2687 2808
95 2682 2809
2676 2036 2810
2061 2809 2811
2398 2810 2812
2664 2349 2813
1758 2652 2814
2649 8 2815
770 2814 2816
508 2645 2817
2632 294 2818
2631 221 2819
359 2819 2820
8 2595 2821
16 95 2822
130 2593 2823
2586 2822 2824
2583 406 2825
113 225 2826
438 90 2827
2563 19 2828
2827 613 2829
2828 227 2830
2562 738 2831
2553 1714 2832
6 1026 2833
1318 2531 2834
52 2833 2835
867 2503 2836
58 2835 2837
2419 2025 2838
99 52 2839
147 5 2840
2415 295 2841
2840 965 2842
2403 26 2843
272 10 2844
218 2394 2845
2365 68 2846
1590 2364 2847
1124 406 2848
2340 1048 2849
2312 2167 2850
1785 2293 2851
457 11 2852
1915 2851 2853
2852 448 2854
184 10 2855
2256 1922 2856
890 2855 2857
182 2250 2858
32 2235 2859
1167 2858 2860
99 2235 2861
158 2209 2862
2202 199 2863
129 2862 2864
10 2863 2865
130 2864 2866
497 2865 2867
101 68 2868
470 2867 2869
1016 2868 2870
91 132 2871
4 2191 2872
53 161 2873
91 2190 2874
116 2181 2875
280 2142 2876
51 2134 2877
369 2876 2878
2115 199 2879
2079 246 2880
241 2056 2881
293 2052 2882
2043 10 2883
152 2041 2884
2025 448 2885
139 2012 2886
1425 2011 2887
936 2006 2888
293 2887 2889
923 5 2890
1986 10 2891
62 124 2892
1951 221 2893
1929 10 2894
1913 95 2895
1542 187 2896
1860 613 2897
1858 948 2898
1840 10 2899
1832 1026 2900
1793 288 2901
1759 671 2902
325 2902 2903
1754 499 2904
1752 1048 2905
1702 96 2906
1700 615 2907
1685 415 2908
1654 120 2909
378 1644 2910
169 11 2911
1634 310 2912
1575 406 2913
1564 1048 2914
1564 14 2915
1546 685 2916
1534 95 2917
91 1516 2918
1505 5 2919
1462 68 2920
2919 1093 2921
5 24 2922
2921 1195 2923
1450 29 2924
1423 29 2925
1418 96 2926
1375 1086 2927
1327 858 2928
2927 295 2929
140 52 2930
1284 487 2931
66 1267 2932
1251 272 2933
1236 288 2934
231 1233 2935
1232 29 2936
1231 18 2937
1227 29 2938
1217 120 2939
91 124 2940
72 1198 2941
2940 870 2942
594 1160 2943
22 68 2944
1130 176 2945
1127 10 2946
1124 20 2947
438 1080 2948
16 1077 2949
130 1077 2950
1056 671 2951
17 2951 2952
9 6 2953
62 2952 2954
1042 118 2955
1027 825 2956
205 2956 2957
1022 29 2958
607 2957 2959
1011 29 2960
996 20 2961
983 138 2962
194 977 2963
941 11 2964
791 907 2965
2964 492 2966
847 2965 2967
146 907 2968
901 834 2969
97 2969 2970
596 363 2971
21 20 2972
2971 5 2973
779 295 2974
145 2974 2975
775 5 2976
91 2975 2977
765 182 2978
207 2978 2979
761 504 2980
755 569 2981
754 13 2982
96 726 2983
714 29 2984
115 2983 2985
705 92 2986
61 26 2987
666 113 2988
664 95 2989
116 659 2990
658 29 2991
115 642 2992
633 29 2993
623 29 2994
597 29 2995
99 5 2996
177 239 2997
579 95 2998
574 10 2999
520 569 3000
76 567 3001
118 567 3002
562 96 3003
554 103 3004
132 530 3005
51 528 3006
504 11 3007
158 476 3008
470 239 3009
97 3008 3010
3009 368 3011
386 236 3012
445 76 3013
441 29 3014
439 133 3015
67 3015 3016
390 13 3017
433 193 3018
429 29 3019
421 29 3020
419 295 3021
388 5 3022
55 380 3023
374 29 3024
345 29 3025
140 132 3026
110 21 3027
328 29 3028
303 29 3029
291 29 3030
23 288 3031
284 29 3032
115 3031 3033
270 20 3034
260 27 3035
238 16 3036
233 29 3037
175 223 3038
210 5 3039
208 68 3040
55 197 3041
175 68 3042
173 118 3043
173 15 3044
3043 156 3045
168 8 3046
164 29 3047
155 113 3048
119 29 3049
92 118 3050
110 76 3051
56 24 3052
4 3052 3053
82 68 3054
165 3051 3055
3050 222 3056
1868 3055 3057
2256 3056 3058
3046 227 3059
3041 60 3060
3036 1331 3061
237 226 3062
51 280 3063
3027 692 3064
3063 187 3065
99 3064 3066
3065 11 3067
7 10 3068
3067 406 3069
70 3068 3070
3017 448 3071
3011 589 3072
2997 2754 3073
490 3073 3074
16 613 3075
1390 3074 3076
769 3075 3077
2979 10 3078
778 2973 3079
383 68 3080
99 2962 3081
11 3080 3082
9 74 3083
807 3082 3084
2771 2953 3085
30 5 3086
58 3085 3087
2930 1723 3088
10 95 3089
1390 25 3090
2922 406 3091
3090 61 3092
3091 161 3093
3092 948 3094
1082 3093 3095
2916 569 3096
1375 2909 3097
2904 349 3098
2554 3098 3099
2896 1367 3100
2892 31 3101
3101 17 3102
31 2890 3103
3102 197 3104
378 3103 3105
3104 96 3106
1800 2885 3107
2880 310 3108
747 3107 3109
1370 2879 3110
4 160 3111
34 2859 3112
2839 380 3113
53 3112 3114
3113 74 3115
2797 5 3116
2192 2792 3117
2788 96 3118
9 2785 3119
2780 1714 3120
16 3119 3121
58 118 3122
199 10 3123
63 2774 3124
3123 2279 3125
308 11 3126
2770 96 3127
55 3126 3128
2765 10 3129
2760 138 3130
74 2750 3131
2749 68 3132
2474 3131 3133
2745 926 3134
2743 991 3135
337 3135 3136
2736 16 3137
2734 1027 3138
3137 1714 3139
989 3138 3140
263 855 3141
500 2728 3142
2708 1132 3143
3143 76 3144
18 3144 3145
2704 2213 3146
200 3145 3147
3146 161 3148
99 217 3149
2688 54 3150
3149 18 3151
94 2684 3152
741 10 3153
210 2673 3154
2108 2643 3155
2616 2585 3156
2202 2596 3157
101 20 3158
763 3157 3159
403 3158 3160
94 158 3161
2589 10 3162
162 2585 3163
438 135 3164
53 3163 3165
2564 166 3166
2559 613 3167
2559 2068 3168
9 18 3169
2537 288 3170
2537 112 3171
5 57 3172
177 2508 3173
1411 3172 3174
51 3173 3175
73 2508 3176
140 6 3177
21 9 3178
2504 589 3179
3178 1077 3180
702 3180 3181
2501 346 3182
95 3181 3183
2488 20 3184
4 3183 3185
3184 1090 3186
2485 111 3187
3186 406 3188
3187 20 3189
2482 65 3190
3189 74 3191
2482 272 3192
2474 448 3193
3192 1160 3194
2470 10 3195
1200 2470 3196
2465 158 3197
3197 76 3198
280 3198 3199
2455 57 3200
390 3199 3201
3200 213 3202
1676 3202 3203
2428 10 3204
2419 182 3205
22 145 3206
3205 176 3207
2415 187 3208
115 165 3209
2410 24 3210
3209 118 3211
2403 221 3212
2394 383 3213
890 3213 3214
2390 10 3215
2390 1026 3216
2374 11 3217
936 76 3218
2365 95 3219
247 2364 3220
99 2349 3221
457 2329 3222
2312 68 3223
67 3222 3224
2293 295 3225
546 3225 3226
464 2281 3227
120 29 3228
2258 20 3229
923 3228 3230
1407 2250 3231
66 3230 3232
2249 569 3233
2194 295 3234
2192 1603 3235
79 14 3236
21 124 3237
191 228 3238
3237 1452 3239
99 3238 3240
3239 76 3241
969 3241 3242
99 2186 3243
325 2181 3244
2179 1317 3245
247 855 3246
2147 68 3247
2137 581 3248
53 2136 3249
3248 132 3250
2115 1391 3251
2114 295 3252
2079 98 3253
2073 10 3254
3253 720 3255
2073 68 3256
63 2058 3257
989 2058 3258
2051 9 3259
1546 2039 3260
3259 692 3261
695 2038 3262
1156 2030 3263
1218 3262 3264
1390 3263 3265
2026 104 3266
62 52 3267
2022 20 3268
1336 2017 3269
510 96 3270
2012 158 3271
7 3270 3272
598 3271 3273
381 3272 3274
556 95 3275
1987 95 3276
941 3275 3277
705 1980 3278
1954 217 3279
1949 1673 3280
3279 640 3281
1949 9 3282
1935 1737 3283
5 60 3284
1930 569 3285
1379 1919 3286
1910 799 3287
7 226 3288
747 1888 3289
500 3288 3290
695 1888 3291
53 1878 3292
722 1878 3293
208 1814 3294
229 1814 3295
4 1814 3296
436 1814 3297
233 1814 3298
1791 10 3299
1778 1401 3300
147 1759 3301
102 10 3302
1743 10 3303
1717 74 3304
52 23 3305
1676 228 3306
1645 187 3307
3306 187 3308
72 111 3309
182 68 3310
3309 383 3311
1642 122 3312
140 1603 3313
1602 113 3314
1124 1601 3315
1588 10 3316
705 1575 3317
1566 29 3318
1565 10 3319
237 3319 3320
554 1561 3321
1555 310 3322
398 3322 3323
1537 10 3324
51 3323 3325
1509 280 3326
97 3326 3327
207 1506 3328
53 1506 3329
1490 95 3330
1488 569 3331
1336 1481 3332
1450 10 3333
31 1420 3334
34 1420 3335
1155 3334 3336
542 3335 3337
29 1416 3338
8 5 3339
1300 3338 3340
93 96 3341
1381 694 3342
610 1359 3343
25 1346 3344
1327 1320 3345
9 1320 3346
16 1312 3347
235 1311 3348
876 3347 3349
1298 9 3350
91 129 3351
8 124 3352
1277 187 3353
474 3352 3354
731 1267 3355
22 61 3356
436 1211 3357
1196 15 3358
4 98 3359
1150 96 3360
3359 13 3361
132 3360 3362
3361 1017 3363
611 3362 3364
1147 20 3365
323 1120 3366
1117 566 3367
131 1107 3368
323 21 3369
438 1104 3370
239 406 3371
215 1080 3372
1073 29 3373
67 3372 3374
1073 10 3375
1069 366 3376
72 1058 3377
1053 569 3378
194 1026 3379
836 1026 3380
1010 74 3381
51 3381 3382
365 1010 3383
55 1000 3384
503 18 3385
956 29 3386
940 29 3387
438 924 3388
923 615 3389
99 3389 3390
907 10 3391
457 3391 3392
55 866 3393
116 3392 3394
94 819 3395
75 10 3396
21 349 3397
802 569 3398
795 29 3399
731 310 3400
725 29 3401
722 193 3402
705 205 3403
702 96 3404
3403 177 3405
596 3404 3406
3405 185 3407
542 3406 3408
696 74 3409
82 692 3410
13 692 3411
691 361 3412
51 3412 3413
619 688 3414
132 667 3415
663 567 3416
130 3415 3417
94 3416 3418
635 29 3419
634 158 3420
622 29 3421
16 617 3422
24 617 3423
312 3422 3424
345 617 3425
611 9 3426
607 18 3427
604 377 3428
543 95 3429
535 29 3430
116 529 3431
514 29 3432
22 11 3433
474 76 3434
166 5 3435
62 457 3436
441 10 3437
161 74 3438
200 370 3439
7 368 3440
11 341 3441
335 29 3442
315 176 3443
200 315 3444
314 74 3445
314 158 3446
3445 120 3447
311 29 3448
116 288 3449
274 95 3450
268 133 3451
57 3451 3452
152 265 3453
4 3452 3454
177 265 3455
261 29 3456
238 202 3457
13 222 3458
219 29 3459
157 3458 3460
202 161 3461
193 95 3462
192 10 3463
16 187 3464
152 177 3465
58 161 3466
157 110 3467
51 153 3468
152 92 3469
28 145 3470
136 138 3471
137 96 3472
136 120 3473
99 124 3474
99 122 3475
55 101 3476
100 96 3477
4 42 3478
4 31 3479
9 68 3480
75 25 3481
27 3480 3482
3477 96 3483
1327 3482 3484
23 113 3485
130 76 3486
342 3485 3487
58 132 3488
2451 3470 3489
3488 3423 3490
3469 907 3491
3467 10 3492
67 166 3493
1609 3464 3494
3493 17 3495
180 12 3496
3495 122 3497
64 191 3498
3497 68 3499
377 3462 3500
201 5 3501
51 3500 3502
3501 166 3503
1533 3461 3504
209 96 3505
3457 12 3506
1800 3505 3507
3506 1708 3508
348 3507 3509
58 3455 3510
8 8 3511
430 3511 3512
182 295 3513
303 10 3514
878 3443 3515
325 60 3516
23 3441 3517
3516 2771 3518
58 3517 3519
17 3440 3520
3438 243 3521
1574 3520 3522
3521 741 3523
2871 3522 3524
4 3523 3525
238 3435 3526
3433 530 3527
202 3527 3528
4 90 3529
460 3528 3530
570 22 3531
3426 349 3532
3531 917 3533
135 10 3534
3533 76 3535
497 3411 3536
695 68 3537
2805 3536 3538
695 10 3539
196 3397 3540
91 3539 3541
351 3540 3542
3396 791 3543
5 215 3544
3543 1305 3545
2564 3544 3546
3384 120 3547
990 8 3548
1039 160 3549
3548 1297 3550
3549 68 3551
3550 1481 3552
13 1048 3553
75 3371 3554
1185 3553 3555
3366 1182 3556
3358 22 3557
3556 295 3558
3557 1437 3559
2805 3356 3560
3351 176 3561
3350 2062 3562
177 3346 3563
337 3344 3564
2451 3341 3565
66 5 3566
19 14 3567
149 3310 3568
131 3305 3569
32 12 3570
97 3302 3571
3570 1056 3572
826 3572 3573
3293 34 3574
140 3291 3575
3574 1440 3576
1643 3284 3577
3282 3002 3578
1949 54 3579
52 22 3580
3579 294 3581
3267 10 3582
947 3251 3583
3582 2068 3584
3243 5 3585
3236 504 3586
2214 30 3587
348 3216 3588
3587 726 3589
131 3589 3590
15 3215 3591
3211 133 3592
73 3591 3593
3206 346 3594
2079 3594 3595
438 3195 3596
22 6 3597
3190 917 3598
2192 3179 3599
3177 380 3600
3169 2006 3601
168 3601 3602
1484 2589 3603
97 3162 3604
388 2616 3605
881 3156 3606
3605 2949 3607
570 3606 3608
5 3153 3609
2194 3125 3610
1935 3609 3611
3122 68 3612
19 3121 3613
29 23 3614
180 3613 3615
3614 265 3616
2353 3616 3617
3111 1222 3618
307 3089 3619
56 3086 3620
3084 29 3621
58 3620 3622
471 3083 3623
3053 10 3624
94 3623 3625
37 39 3626
59 8 3627
3626 10 3628
3627 998 3629
40 3628 3630
3629 213 3631
35 3630 3632
3039 176 3633
16 3632 3634
3039 907 3635
44 3634 3636
51 228 3637
441 3636 3638
3637 544 3639
3035 95 3640
293 14 3641
3028 54 3642
3641 92 3643
3026 16 3644
3026 361 3645
1842 3012 3646
52 3012 3647
158 10 3648
59 3647 3649
951 3648 3650
499 113 3651
163 3007 3652
66 3651 3653
488 3007 3654
525 17 3655
2704 3005 3656
3655 95 3657
1453 3002 3658
92 3001 3659
890 3001 3660
207 3659 3661
23 13 3662
2990 416 3663
51 3662 3664
312 2987 3665
19 2987 3666
2985 10 3667
142 3666 3668
202 14 3669
195 10 3670
131 3669 3671
11 95 3672
2027 2972 3673
3672 1287 3674
12 3673 3675
986 3674 3676
17 3675 3677
878 350 3678
836 3677 3679
3678 1492 3680
2966 10 3681
941 22 3682
425 22 3683
3682 10 3684
3683 20 3685
325 3685 3686
1812 2949 3687
425 2944 3688
444 2944 3689
438 3688 3690
1767 3689 3691
111 1223 3692
2937 2360 3693
348 3692 3694
1775 2926 3695
2918 741 3696
2918 74 3697
1368 2913 3698
2912 10 3699
74 25 3700
2882 118 3701
3700 96 3702
10 3702 3703
2882 102 3704
1318 3703 3705
2871 113 3706
14 2854 3707
3706 227 3708
99 3707 3709
1484 2854 3710
2844 900 3711
21 3711 3712
941 2844 3713
2451 3712 3714
99 2826 3715
2001 2821 3716
424 2821 3717
2811 29 3718
2803 1005 3719
2803 5 3720
21 54 3721
79 2785 3722
3721 567 3723
257 3723 3724
2784 10 3725
2780 1418 3726
2777 10 3727
3726 6 3728
12 158 3729
60 112 3730
1662 3729 3731
12 3730 3732
2769 31 3733
140 3732 3734
3733 1481 3735
323 398 3736
325 486 3737
3736 492 3738
3737 68 3739
546 406 3740
2760 352 3741
3740 415 3742
3741 2039 3743
9 569 3744
54 2754 3745
765 2750 3746
2138 3745 3747
325 3746 3748
2747 10 3749
2745 457 3750
722 9 3751
3750 242 3752
3751 98 3753
10 734 3754
525 2743 3755
777 3754 3756
2736 692 3757
187 2734 3758
115 2728 3759
754 3758 3760
91 2708 3761
15 2697 3762
2688 977 3763
443 3762 3764
17 182 3765
2685 29 3766
3765 917 3767
912 3767 3768
878 2684 3769
54 3768 3770
82 2673 3771
22 3770 3772
1298 2666 3773
323 3772 3774
180 2661 3775
239 2643 3776
2627 272 3777
202 3776 3778
169 3777 3779
4 3778 3780
24 2600 3781
99 2600 3782
256 3781 3783
67 2596 3784
113 2595 3785
52 18 3786
549 3785 3787
3786 476 3788
1170 3788 3789
73 13 3790
99 196 3791
2586 361 3792
2583 1601 3793
213 5 3794
417 295 3795
67 3794 3796
398 3795 3797
2563 742 3798
9 3797 3799
102 96 3800
267 3799 3801
364 3800 3802
2554 960 3803
2553 60 3804
2542 10 3805
3804 640 3806
1952 2534 3807
2010 2534 3808
74 2531 3809
2507 96 3810
2182 3809 3811
2504 96 3812
238 3812 3813
2502 688 3814
2496 858 3815
55 3815 3816
59 2496 3817
19 2025 3818
2465 456 3819
2420 3818 3820
9 2455 3821
2446 295 3822
92 3821 3823
2422 40 3824
1662 3823 3825
2422 39 3826
2410 14 3827
2410 295 3828
3827 640 3829
2408 5 3830
2398 469 3831
2393 912 3832
3831 110 3833
2391 76 3834
3833 310 3835
2340 415 3836
1609 2329 3837
103 68 3838
2280 1575 3839
2273 1048 3840
58 2266 3841
2265 74 3842
2245 692 3843
2238 692 3844
1975 2231 3845
1842 2231 3846
1908 2231 3847
568 2231 3848
6 3847 3849
13 177 3850
570 3849 3851
2206 560 3852
2198 741 3853
3852 176 3854
2194 567 3855
58 76 3856
152 122 3857
3856 370 3858
2189 10 3859
2188 5 3860
522 2181 3861
2178 68 3862
2167 225 3863
109 3863 3864
2146 10 3865
1827 2126 3866
65 2125 3867
2115 185 3868
323 3867 3869
2110 1223 3870
2110 17 3871
13 2109 3872
55 118 3873
218 3872 3874
3873 93 3875
235 13 3876
2095 884 3877
2092 29 3878
67 2082 3879
1903 2082 3880
2072 10 3881
263 2066 3882
2058 24 3883
3883 295 3884
1374 3884 3885
11 2058 3886
2055 29 3887
175 3886 3888
110 2050 3889
598 2050 3890
152 3889 3891
21 6 3892
2029 92 3893
1395 3892 3894
3893 406 3895
554 3895 3896
2028 21 3897
2028 19 3898
2028 5 3899
60 21 3900
3899 653 3901
1942 3900 3902
3901 415 3903
2012 110 3904
3903 33 3905
554 3904 3906
463 2007 3907
1992 74 3908
97 1980 3909
3908 640 3910
1973 29 3911
1971 10 3912
1969 101 3913
1530 1967 3914
3913 581 3915
1949 1026 3916
3915 102 3917
1075 1943 3918
1064 406 3919
1930 74 3920
785 3919 3921
1924 29 3922
763 3921 3923
1915 444 3924
15 71 3925
3924 17 3926
630 3925 3927
3926 1198 3928
1897 295 3929
1170 1896 3930
1890 272 3931
1883 74 3932
6 19 3933
1872 29 3934
8 120 3935
6 202 3936
3935 294 3937
3936 294 3938
388 3937 3939
207 3938 3940
1860 10 3941
66 685 3942
1845 29 3943
1834 1064 3944
1827 29 3945
3944 310 3946
1826 10 3947
445 132 3948
1800 636 3949
1053 3949 3950
1793 1222 3951
1779 645 3952
1375 1776 3953
3952 187 3954
1772 589 3955
705 3955 3956
1755 29 3957
1752 295 3958
1700 1026 3959
260 1689 3960
581 1689 3961
1676 132 3962
733 3961 3963
3962 741 3964
1675 108 3965
1662 54 3966
3965 448 3967
3966 129 3968
1652 29 3969
10 185 3970
1642 5 3971
1641 3970 3972
1629 29 3973
14 60 3974
1585 280 3975
118 26 3976
3975 199 3977
340 3976 3978
1105 11 3979
100 3978 3980
3979 476 3981
1578 29 3982
1576 31 3983
1575 113 3984
3983 308 3985
1570 20 3986
3985 24 3987
1570 620 3988
941 1561 3989
1557 96 3990
733 3990 3991
22 1551 3992
1546 912 3993
1200 3992 3994
325 1541 3995
1540 29 3996
1540 19 3997
175 1532 3998
3997 135 3999
115 1532 4000
1520 29 4001
1515 129 4002
1505 52 4003
4002 242 4004
4003 15 4005
4004 1077 4006
4005 834 4007
1200 1499 4008
1111 1492 4009
664 1492 4010
1421 1492 4011
21 133 4012
1484 371 4013
51 19 4014
351 1465 4015
1455 10 4016
955 1440 4017
1436 21 4018
4018 471 4019
4019 448 4020
567 4020 4021
1435 8 4022
16 4021 4023
4022 95 4024
314 4023 4025
1435 998 4026
1435 1027 4027
1435 6 4028
